In [2]:
#f string in python(>=3.6)

In [6]:
import pandas as pd
import re 
import os,sys

In [7]:
!python--version

'python--version' 不是內部或外部命令、可執行的程式或批次檔。

In [14]:
word1='number1'
word2='number2'
number1=1
number2=2

In [17]:
f'{word1.capitalize()} is {number1} and {word2.upper()} is {number2}'

'Number1 is 1 and NUMBER2 is 2'

In [18]:
#older python version f string

In [21]:
a ='hi'
b =88
c =99

In [23]:
'{} and {}'.format(a,b)

'hi and 88'

In [25]:
'{1} and {0}'.format(a,b)

'88 and hi'

In [26]:
'{1} and {0}'.format(number1, word1)

'number1 and 1'

In [27]:
#pandas merge

In [33]:
data_name_age = pd.DataFrame({'name':['A','B','C','D','E'],'age':[18,67,33,66,22]})
data_name_sex = pd.DataFrame({'name':['A','B','C','D','E'],'sex':['m','m','f','f','f']})
data_name_car = pd.DataFrame({'name':['A','B','C','D','Z','X'],'car':['y','n','y','n','y','y']})

In [31]:
data_name_age

  name  age
0    A   18
1    B   67
2    C   33
3    D   66
4    E   22

In [34]:
data_name_age.merge(data_name_sex,left_index=True,right_index=True,how='inner')

  name_x  age name_y sex
0      A   18      A   m
1      B   67      B   m
2      C   33      C   f
3      D   66      D   f
4      E   22      E   f

In [47]:
data_name_age.merge(data_name_sex,left_on='name',right_on='name',how='inner')

  name  age sex
0    A   18   m
1    B   67   m
2    C   33   f
3    D   66   f
4    E   22   f

In [37]:
data_name_age.merge(data_name_sex)

  name  age sex
0    A   18   m
1    B   67   m
2    C   33   f
3    D   66   f
4    E   22   f

In [38]:
pd.merge(data_name_age,data_name_sex)

  name  age sex
0    A   18   m
1    B   67   m
2    C   33   f
3    D   66   f
4    E   22   f

In [39]:
pd.merge(data_name_age,data_name_car)

  name  age car
0    A   18   y
1    B   67   n
2    C   33   y
3    D   66   n

In [41]:
pd.merge(data_name_age,data_name_car,how='outer')

  name   age  car
0    A  18.0    y
1    B  67.0    n
2    C  33.0    y
3    D  66.0    n
4    E  22.0  NaN
5    Z   NaN    y
6    X   NaN    y

In [42]:
pd.merge(data_name_age,data_name_car,how='left')

  name  age  car
0    A   18    y
1    B   67    n
2    C   33    y
3    D   66    n
4    E   22  NaN

In [54]:
pd.merge(data_name_age,data_name_car,how='outer').merge(data_name_sex,how='outer')

  name   age  car  sex
0    A  18.0    y    m
1    B  67.0    n    m
2    C  33.0    y    f
3    D  66.0    n    f
4    E  22.0  NaN    f
5    Z   NaN    y  NaN
6    X   NaN    y  NaN

In [55]:
[_.merge for i, row in [data_name_age,data_name_car,data_name_sex]]

[<bound method DataFrame.merge of   name   age  car  sex
 0    A  18.0    y    m
 1    B  67.0    n    m
 2    C  33.0    y    f
 3    D  66.0    n    f
 4    E  22.0  NaN    f
 5    Z   NaN    y  NaN
 6    X   NaN    y  NaN>,
 <bound method DataFrame.merge of   name   age  car  sex
 0    A  18.0    y    m
 1    B  67.0    n    m
 2    C  33.0    y    f
 3    D  66.0    n    f
 4    E  22.0  NaN    f
 5    Z   NaN    y  NaN
 6    X   NaN    y  NaN>,
 <bound method DataFrame.merge of   name   age  car  sex
 0    A  18.0    y    m
 1    B  67.0    n    m
 2    C  33.0    y    f
 3    D  66.0    n    f
 4    E  22.0  NaN    f
 5    Z   NaN    y  NaN
 6    X   NaN    y  NaN>]

In [56]:
for i, row in enumerate(['data_name_age','data_name_car','data_name_sex']):
    print(i,row)

0 data_name_age
1 data_name_car
2 data_name_sex

In [74]:
for i ,row in enumerate([data_name_age,data_name_car,data_name_sex]):
    if i == 0:
        pass
    else:
        row = row.merge()

TypeError: merge() missing 1 required positional argument: 'right'

In [83]:
all =[data_name_age,data_name_car,data_name_sex]
test= all[0]
for i in all[1:3]:
    test = test.merge(i,how='outer')
print(test)

  name   age  car  sex
0    A  18.0    y    m
1    B  67.0    n    m
2    C  33.0    y    f
3    D  66.0    n    f
4    E  22.0  NaN    f
5    Z   NaN    y  NaN
6    X   NaN    y  NaN